g = input() + input()

v = {"каменькамень": "ничья",
     "ножницыножницы": "ничья",
     "бумагабумага": "ничья",
     "ящерицаящерица": "ничья",
     "СпокСпок": "ничья", 
     "каменьножницы": "Тимур",
     "каменьящерица": "Тимур",
     "ножницыбумага": "Тимур",
     "ножницыящерица": "Тимур",
     "бумагакамень": "Тимур",
     "бумагаСпок": "Тимур",
     "ящерицабумага": "Тимур",
     "ящерицаСпок": "Тимур",
     "Споккамень": "Тимур",
     "Спокножницы": "Тимур",
     "ножницыкамень": "Руслан",
     "ящерицакамень": "Руслан",
     "бумаганожницы": "Руслан",
     "ящерицаножницы": "Руслан",
     "каменьбумага": "Руслан",
     "Спокбумага": "Руслан",
     "бумагаящерица": "Руслан",
     "каменьСпок": "Руслан",
     "ножницыСпок": "Руслан",
    "Спокящерица": "Руслан"}

print(v[g])
